{"source": "name : The Vaults | eatType : pub | priceRange : high | customer rating : 1 out of 5 | near : Café Adriatic [SEP] A pub called The Vaults has a high price range and a customer rating of 1 out of 5. It is near Café Adriatic.", "target": "The Vaults is a pub near Café Adriatic with a high price range and a 1 out of 5 customer rating."}
{"source": "name : Clowns | eatType : pub | priceRange : less than £20 | customer rating : low | area : riverside [SEP] Clowns is a pub type restaurant in the riverside area. Price range is less than £20 and it has a low customer rating.", "target": "Clowns is a pub located in the riverside area. It has a low customer rating and a price range of less than £20."}
{"source": "name : The Cricketers | eatType : restaurant | food : Chinese | near : All Bar One [SEP] Located near All Bar One is a Chinese restaurant called The Cricketers.", "target": "The Cricketers is a Chinese restaurant near All Bar One."}
{"source": "name : The Cambridge Blue | eatType : restaurant | food : Chinese | customer rating : low [SEP] The Cambridge Blue is a Chinese restaurant. Currently with a low customer rating.", "target": "The Cambridge Blue is a Chinese restaurant with a low customer rating."}
{"source": "name : Aromi | eatType : restaurant | food : French | area : riverside [SEP] There is a French restaurant on the riverside named Aromi.", "target": "Aromi is a French restaurant located in riverside."}
{"source": "name : The Cambridge Blue | eatType : restaurant | food : English | customer rating : average [SEP] The Cambridge Blue is a traditionally British restaurant, offering 3 star food", "target": "The Cambridge Blue is an English restaurant with an average customer rating."}
{"source": "name : The Mill | eatType : pub | food : English | priceRange : moderate | area : riverside [SEP] The Mill is a pub serving English food. It is located in the outer city center. and has an average price range.", "target": "The Mill is a pub that serves English food in the moderate price range. It is located in the riverside area."}
{"source": "name : Blue Spice | food : Italian | priceRange : cheap | area : riverside [SEP] Blue Spice: Italian food served by the riverside with an inexpensive price range.", "target": "Blue Spice is a cheap Italian restaurant located in riverside."}
{"source": "name : The Dumpling Tree | eatType : restaurant | food : Italian | priceRange : high [SEP] This Italian restaurant names The Dumpling Tree has high prices.", "target": "The Dumpling Tree is a high priced Italian restaurant."}
{"source": "name : Blue Spice | food : Indian | priceRange : cheap | area : riverside [SEP] Blue Spice is a restaurant in the riverside area that sells cheaply priced Indian food.", "target": "Blue Spice is a cheap Indian restaurant located in riverside."}
{"source": "name : Clowns | eatType : coffee shop | food : Italian | customer rating : 5 out of 5 | area : riverside | near : Clare Hall [SEP] The Clowns coffee shop sells great Italian food at high prices, but the food is of the best quality. The Clowns coffee shop can be found next to the river across from Clare Hall.", "target": "Clowns is a coffee shop that serves Italian food and has a 5 out of 5 customer rating. It is located in the riverside area near Clare Hall."}
{"source": "name : The Golden Palace | eatType : coffee shop | food : Italian | priceRange : high | customer rating : average | area : riverside [SEP] Located near the river, a short distance from St. John's College, is The Golden Palace. This upscale setting offers food and beverages sure to please the most discriminating palates.", "target": "The Golden Palace is a coffee shop that serves Italian food in the high price range. It is located in the riverside area. It has an average customer rating."}
{"source": "name : Fitzbillies | food : English | priceRange : high | near : The Six Bells [SEP] Fitzbillies has high-priced traditional UK foods. Located near The Six Bells.", "target": "Fitzbillies is a high priced English restaurant near The Six Bells."}
{"source": "name : The Mill | eatType : pub | food : Chinese | priceRange : cheap | area : riverside [SEP] The Mills is a pub that serves cheap Chinese food in riverside.", "target": "The Mill is a cheap Chinese pub located in the riverside area."}
{"source": "name : The Waterman | eatType : pub | food : French | customer rating : average | area : riverside [SEP] The Waterman is a three star pub located just north of the City Centre that serves fine wines and cheeses.", "target": "The Waterman is a pub in riverside that serves French food. It has a average customer rating."}
{"source": "name : Travellers Rest Beefeater | priceRange : high | customer rating : average | area : riverside | near : Café Adriatic [SEP] Near Café Adriatic, the prices are high, the customer rating is about average, its near the riverside, its name is Travellers Rest Beefeater.", "target": "Travellers Rest Beefeater is located near Café Adriatic in the riverside area. It has an average customer rating and is priced high."}
{"source": "name : The Golden Palace | eatType : restaurant | priceRange : cheap [SEP] The Golden Palace is a restaurant providing a cheap price range.", "target": "The Golden Palace is a cheap restaurant."}
{"source": "name : The Eagle | food : French | customer rating : 5 out of 5 [SEP] The Eagle is a French restaurant with a customer rating of 5 out of 5.", "target": "The Eagle is a French restaurant with a 5 out of 5 customer rating."}
{"source": "name : The Vaults | eatType : coffee shop | priceRange : £20-25 | customer rating : high | area : riverside | near : Café Brazil [SEP] Come try our new coffee shop The Vaults, located near Café Brazil. We have high customer ratings and prices ranging from 20-25. This beautiful riverside eatery will surely be a favorite.", "target": "The Vaults is a coffee shop near Café Brazil in the riverside area. It has a high customer rating and is priced between £20-25."}
{"source": "name : Green Man | eatType : pub | food : English | area : riverside | near : Café Rouge [SEP] Green Man is a pub near Café Rouge that has English food. It is located in Riverside.", "target": "Green Man is a pub near Café Rouge in the riverside area serving English food."}
{"source": "name : The Cambridge Blue | eatType : restaurant | food : French | customer rating : 5 out of 5 [SEP] There is a French restaurant that is 5 out of 5 rated restaurant called The Cambridge Blue", "target": "The Cambridge Blue is a restaurant serving French food with a 5 out of 5 customer rating."}
{"source": "name : Clowns | eatType : pub | priceRange : £20-25 | customer rating : high | area : riverside [SEP] Clowns is located in the riverside area. It is a pub that costs 20-25 and has a high customer rating.", "target": "Clowns is a pub in the riverside area with a high customer rating. It is priced between £20-25."}
{"source": "name : The Vaults | eatType : coffee shop | priceRange : less than £20 | customer rating : low | area : riverside | near : Café Brazil [SEP] The Vaults is a coffee shop located near Café Brazil in the riverside area. It has a customer rating of low and a price range of less than £20.", "target": "The Vaults is a coffee shop near Café Brazil in the riverside area. It has a low customer rating and a price range of less than £20."}
{"source": "name : The Vaults | eatType : coffee shop | priceRange : £20-25 | customer rating : high | area : riverside | near : Café Brazil [SEP] Come try our new coffee shop The Vaults, located near Café Brazil. We have high customer ratings and prices ranging from 20-25. This beautiful riverside eatery will surely be a favorite.", "target": "The Vaults is a coffee shop near Café Brazil in the riverside area. It has a high customer rating and prices range from £20-25."}
{"source": "name : Strada | eatType : pub | food : English | customer rating : average | near : Yippee Noodle Bar [SEP] Strada is a pub that serves English food. Other customers give it an average rating. It's located near Yippee Noodle Bar.", "target": "Strada is a pub that serves English food and has an average customer rating. It is located near Yippee Noodle Bar."}
{"source": "name : Aromi | eatType : restaurant | food : Japanese | area : riverside [SEP] There is a Japanese restaurant named Aromi in the Riverside area.", "target": "Aromi is a Japanese restaurant located in the riverside area."}
{"source": "name : The Phoenix | food : Chinese | customer rating : 5 out of 5 | area : city centre [SEP] A 5 out of 5 customer-rated restaurant, The Phoenix, serves Chinese food in the city centre.", "target": "The Phoenix is a Chinese restaurant in the city centre with a 5 out of 5 customer rating."}
{"source": "name : The Phoenix | food : Italian | customer rating : average | area : riverside [SEP] In Riverside, there is a place called The Phoenix that serves Italian food. It has an average customer rating.", "target": "The Phoenix is an Italian restaurant located in the riverside area. It has an average customer rating."}
{"source": "name : Midsummer House | food : Indian | customer rating : low | near : Café Rouge [SEP] Midsummer House has a low customer satisfaction and is located close to Café Rouge.", "target": "Midsummer House is a low rated Indian restaurant near Café Rouge."}
{"source": "name : Wildwood | eatType : restaurant | customer rating : low | near : Café Rouge [SEP] Wildwood is a restaurant, near Café Rouge. It has a low customer rating.", "target": "Wildwood is a restaurant near Café Rouge with a low customer rating."}
{"source": "name : The Golden Palace | eatType : coffee shop | food : Japanese | priceRange : more than £30 | customer rating : 5 out of 5 | area : city centre [SEP] The Golden Palace serves Japanese food and is located in the city centre. Has a customer rating of 5 out of 5. It is a coffee shop and has a price range of more then 30.", "target": "The Golden Palace is a coffee shop serving Japanese food in the more than £30 price range. It is located in the city centre and has a 5 out of 5 customer rating."}
{"source": "name : Fitzbillies | food : Italian | priceRange : high | near : The Six Bells [SEP] Near The Six Bells, The Fitzbillies has a high price range for Italian food.", "target": "Fitzbillies is a high priced Italian restaurant located near The Six Bells."}
{"source": "name : Blue Spice | food : Chinese | priceRange : high | area : riverside [SEP] Blue Spice is a riverside Chinese restaurant with a high price range.", "target": "Blue Spice is a high priced Chinese restaurant located in riverside."}
{"source": "name : Wildwood | eatType : coffee shop | food : French | priceRange : £20-25 | customer rating : 3 out of 5 | near : Ranch [SEP] Located near Ranch, Wildwood is a coffee shop that serves French food at a price range of £20-25. Wildwood has a 3 out of 5 customer rating.", "target": "Wildwood is a coffee shop that serves French food in the £20-25 price range. It is near Ranch and has a customer rating of 3 out of 5."}
{"source": "name : The Golden Palace | eatType : restaurant | priceRange : less than £20 [SEP] The Golden Palace is a restaurant where the prices are less than 20 £.", "target": "The Golden Palace is a restaurant that is priced less than £20."}
{"source": "name : Green Man | eatType : pub | food : Chinese | area : riverside | near : Café Rouge [SEP] There is a pub called Green Man that serves Chinese food by the riverside, near Café Rouge.", "target": "Green Man is a pub that serves Chinese food in the riverside area near Café Rouge."}
{"source": "name : Wildwood | eatType : pub | food : Italian | priceRange : £20-25 | customer rating : high [SEP] If you are looking for an Italian pub in the price range of £20-25, Wildwood has high customer ratings.", "target": "Wildwood is a pub that serves Italian food in the £20-25 price range. It has a high customer rating."}
{"source": "name : The Cambridge Blue | eatType : restaurant | food : Japanese | customer rating : high [SEP] The Cambridge Blue is a Japanese restaurant. It has a high customer rating.", "target": "The Cambridge Blue is a Japanese restaurant with a high customer rating."}
{"source": "name : The Eagle | food : Italian | customer rating : low [SEP] A fair meal can be purchased from The Eagle, which is off the main road.", "target": "The Eagle is a low rated Italian restaurant."}
{"source": "name : The Twenty Two | eatType : pub | customer rating : 3 out of 5 | area : riverside | near : Café Sicilia [SEP] Near Café Sicilia in the riverside area, is a pub called The Twenty Two, and has a customer rating of 3 out of 5.", "target": "The Twenty Two is a pub near Café Sicilia in the riverside area. It has a customer rating of 3 out of 5."}
{"source": "name : The Waterman | eatType : pub | food : Japanese | customer rating : low | area : riverside [SEP] The Waterman is not a very good pub. They serve Japanese food and are in the riverside area.", "target": "The Waterman is a pub in riverside that serves Japanese food. It has a low customer rating."}
{"source": "name : Green Man | eatType : pub | food : Indian | area : riverside | near : Café Rouge [SEP] In the riverside area, there is a pub which offers Indian food. The name is the Green Man, and it's located near the Café Rouge.", "target": "Green Man is a pub that serves Indian food in the riverside area near Café Rouge."}
{"source": "name : Loch Fyne | food : English | customer rating : 5 out of 5 | area : city centre | near : The Rice Boat [SEP] Loch Fyne is a English food place with a customer rating of 5 out of 5. It is located in the city centre near The Rice Boat.", "target": "Loch Fyne is a 5 out of 5 customer rated English restaurant located in the city centre near The Rice Boat."}
{"source": "name : The Cambridge Blue | eatType : restaurant | food : Chinese | customer rating : 3 out of 5 [SEP] The Cambridge Blue is a restaurant that provides Chinese food Its customer rating is 3 out of 5.", "target": "The Cambridge Blue is a Chinese restaurant with a customer rating of 3 out of 5."}
{"source": "name : The Dumpling Tree | eatType : restaurant | food : French | priceRange : high [SEP] The Dumpling Tree is a restaurant that serves high price range French food.", "target": "The Dumpling Tree is a high priced restaurant serving French food."}
{"source": "name : Travellers Rest Beefeater | priceRange : high | customer rating : 1 out of 5 | area : riverside | near : Café Adriatic [SEP] The Travellers Rest Beefeater can be found in the riverside area near the Café Adriatic. Customers will find it in the high price Range and give it a customer Rating of 1 out of 5.", "target": "Travellers Rest Beefeater is located near Café Adriatic in the riverside area. It has a high price range and a customer rating of 1 out of 5."}
{"source": "name : The Dumpling Tree | eatType : restaurant | food : Japanese | priceRange : cheap [SEP] The Dumpling Tree is a restaurant that serves Japanese food for cheap.", "target": "The Dumpling Tree is a cheap Japanese restaurant."}
{"source": "name : The Eagle | food : Chinese | customer rating : low [SEP] The Eagle is a Chinese restaurant that has a low customer rating.", "target": "The Eagle is a Chinese restaurant with a low customer rating."}
{"source": "name : The Rice Boat | food : French | area : riverside [SEP] For a riverside restaurant serving French cuisine, try The Rice Boat.", "target": "The Rice Boat is a French restaurant located in riverside."}
{"source": "name : Browns Cambridge | food : French | priceRange : cheap | customer rating : 5 out of 5 [SEP] Browns Cambridge is home to good food and drinks and scintillating deserts at very affordable prices.", "target": "Browns Cambridge is a cheap French restaurant with a 5 out of 5 customer rating."}
{"source": "name : The Phoenix | food : Chinese | customer rating : average | area : city centre [SEP] The Phoenix is providing Chinese food in the price range. It is located in the city centre. Its customer rating is average.", "target": "The Phoenix is a Chinese restaurant in the city centre with an average customer rating."}
{"source": "name : Alimentum | food : English | priceRange : more than £30 | customer rating : high | area : riverside | near : Yippee Noodle Bar [SEP] Alimentum offers great home cooked British meals at affordable prices. Conveniently situated on the city ring road close to Yippee Noodle Bar.", "target": "Alimentum is a high rated restaurant near Yippee Noodle Bar in the riverside area. It serves English food at a price range of more than £30."}
{"source": "name : The Waterman | eatType : pub | food : French | customer rating : average | area : riverside [SEP] The Waterman is a three star pub located just north of the City Centre that serves fine wines and cheeses.", "target": "The Waterman is a pub that serves French food in the riverside area. It has an average customer rating."}
{"source": "name : Clowns | eatType : pub | priceRange : £20-25 | customer rating : high | area : city centre [SEP] Clowns is a pub located in the city centre with a high customer rating. Their prices are between £20-25.", "target": "Clowns is a pub in the city centre that has a high customer rating. It is priced between £20-25."}
{"source": "name : The Vaults | eatType : coffee shop | priceRange : high | customer rating : 1 out of 5 | area : riverside | near : Café Brazil [SEP] There is a high priced coffee shop called The Vaults in the riverside area near Café Brazil. Previous customers have rated it as 1 out of 5.", "target": "The Vaults is a high priced coffee shop located near Café Brazil in the riverside area. It has a customer rating of 1 out of 5."}
{"source": "name : Wildwood | eatType : pub | food : Japanese | priceRange : cheap | customer rating : 5 out of 5 [SEP] Wildwood is a pub providing sushi in the low price range. It is located in the city centre.", "target": "Wildwood is a cheap pub that serves Japanese food. It has a 5 out of 5 customer rating."}
{"source": "name : Bibimbap House | food : Italian | area : city centre | near : The Rice Boat [SEP] The Italian restaurant, Bibimbap House, is neat The Rice Boat in the center of the city.", "target": "Bibimbap House is an Italian restaurant located in the city centre near The Rice Boat."}
{"source": "name : The Cambridge Blue | eatType : pub | food : Japanese | priceRange : cheap | near : Café Brazil [SEP] The Cambridge Blue pub offers a cheap price range, serving Japanese food it resides near the Café Brazil.", "target": "The Cambridge Blue is a cheap pub that serves Japanese food. It is located near Café Brazil."}
{"source": "name : Clowns | eatType : pub | priceRange : high | customer rating : 3 out of 5 | area : riverside [SEP] The Clowns in riverside is a pub and the price Range is high but has a customer Rating of 3 out of 5", "target": "Clowns is a pub in the riverside area with a high price range and a customer rating of 3 out of 5."}
{"source": "name : Fitzbillies | food : Indian | priceRange : high | near : The Six Bells [SEP] There is a high-priced Indian restaurant near The Six Bells called Fitzbillies", "target": "Fitzbillies is a high priced Indian restaurant near The Six Bells."}
{"source": "name : The Cambridge Blue | eatType : pub | food : Italian | priceRange : cheap | near : Café Brazil [SEP] For a pub that serves Italian food near Café Brazil, try The Cambridge Blue. They have a cheap price range.", "target": "The Cambridge Blue is a cheap pub that serves Italian food. It is located near Café Brazil."}
{"source": "name : Wildwood | eatType : restaurant | customer rating : average | near : Café Rouge [SEP] Customers have rated the Wildwood restaurant situated near Café Rouge as average.", "target": "Wildwood is a restaurant near Café Rouge with an average customer rating."}
{"source": "name : The Eagle | food : French | customer rating : average [SEP] The Eagle primarily does wine tastings and pairings and is a three star restaurant.", "target": "The Eagle is a French restaurant with average customer ratings."}
{"source": "name : The Eagle | food : Japanese | customer rating : low [SEP] The Eagle serves Japanese food, and it has a low customer rating.", "target": "The Eagle is a Japanese restaurant with a low customer rating."}
{"source": "name : The Dumpling Tree | eatType : restaurant | food : Japanese | priceRange : high [SEP] For a quality Japanese restaurant, visit The Dumpling Tree. Meals are in the high price range.", "target": "The Dumpling Tree is a high priced Japanese restaurant."}
{"source": "name : Taste of Cambridge | eatType : restaurant | priceRange : cheap | customer rating : 5 out of 5 [SEP] It has a customer rating of 5 out of 5. Taste of Cambridge is a cheap restaurant.", "target": "Taste of Cambridge is a cheap restaurant with a 5 out of 5 customer rating."}
{"source": "name : The Golden Palace | eatType : coffee shop | food : Italian | priceRange : more than £30 | customer rating : high | area : riverside [SEP] There is a coffee shop with a price range of more than £30, that has a high customer rating called The Golden Palace that serves Italian food by the riverside.", "target": "The Golden Palace is a coffee shop serving Italian food in the more than £30 price range. It is located in the riverside area. It has a high customer rating."}
{"source": "name : Blue Spice | food : French | priceRange : high | area : riverside [SEP] Set in a stunning riverside location, Blue Spice is a French restaurant with high prices but even higher quality.", "target": "Blue Spice is a high priced French restaurant located in riverside."}
{"source": "name : The Cricketers | eatType : restaurant | food : French | near : All Bar One [SEP] The restaurant called The Cricketers which is near All Bar One serves French food.", "target": "The Cricketers is a restaurant serving French food near All Bar One."}
{"source": "name : The Phoenix | food : Chinese | customer rating : average | area : riverside [SEP] Located riverside is The Phoenix which serves Chinese food. It has an average customer rating.", "target": "The Phoenix is a Chinese restaurant in riverside with an average customer rating."}
{"source": "name : Wildwood | eatType : pub | food : Chinese | priceRange : cheap | customer rating : 5 out of 5 [SEP] There is a pub with cheap prices that sells Chinese food. Wildwood has been rated 5 out of 5.", "target": "Wildwood is a cheap pub that serves Chinese food. It has a 5 out of 5 customer rating."}
{"source": "name : The Punter | food : Japanese | priceRange : cheap [SEP] There is a place called The Punter which offers cheap Japanese food.", "target": "The Punter is a cheap Japanese restaurant."}
{"source": "name : The Vaults | eatType : coffee shop | priceRange : £20-25 | customer rating : high | area : riverside | near : Café Brazil [SEP] Come try our new coffee shop The Vaults, located near Café Brazil. We have high customer ratings and prices ranging from 20-25. This beautiful riverside eatery will surely be a favorite.", "target": "The Vaults is a coffee shop located near Café Brazil in the riverside area. It has a high customer rating and is priced between £20-25."}
{"source": "name : The Phoenix | food : Indian | priceRange : cheap | customer rating : 5 out of 5 | area : riverside [SEP] The Phoenix restaurant, which provides both eat in and take out, at a low cost, with great Indian food, located near the riverside area", "target": "The Phoenix is a cheap Indian restaurant located in the riverside area. It has a customer rating of 5 out of 5."}
{"source": "name : Browns Cambridge | food : English | priceRange : cheap | customer rating : average [SEP] Low priced English food can be found in Browns Cambridge which has received an average customer rating.", "target": "Browns Cambridge is a cheap English restaurant with an average customer rating."}
{"source": "name : Blue Spice | food : Indian | priceRange : high | area : riverside [SEP] Blue Spice provides Indian food in the high price range. It is located in the riverside.", "target": "Blue Spice is a high priced Indian restaurant located in riverside."}
{"source": "name : The Rice Boat | food : Japanese | area : city centre [SEP] Japanese cuisine is offered at The Rice Boat located in the city centre.", "target": "The Rice Boat is a Japanese restaurant located in the city centre."}
{"source": "name : The Golden Palace | eatType : restaurant | priceRange : more than £30 [SEP] For a high priced restaurant The Golden Palace is a great place to go to.", "target": "The Golden Palace is a restaurant with a price range of more than £30."}
{"source": "name : Wildwood | eatType : pub | food : English | priceRange : £20-25 | customer rating : high [SEP] You can find Wildwood, a five-star pub in the mid price range that serves British food, across from a school.", "target": "Wildwood pub is a pub that serves English food and has a high customer rating. It is priced between £20-25."}
{"source": "name : The Phoenix | food : French | customer rating : 5 out of 5 | area : city centre [SEP] Located in city centre, The Phoenix received a 5 out of 5 customer rating. They are a French restaurant.", "target": "The Phoenix is a French restaurant in the city centre with a 5 out of 5 customer rating."}
{"source": "name : The Eagle | food : Indian | customer rating : low [SEP] The Eagle is an Indian restaurant with low customer rating.", "target": "The Eagle is a low rated Indian restaurant."}
{"source": "name : Wildwood | eatType : pub | food : Japanese | priceRange : £20-25 | customer rating : 3 out of 5 [SEP] There is a Japanese pub that charges between £20 and £25 called Wildwood. It gets a 3 out of 5 customer rating.", "target": "Wildwood is a pub that serves Japanese food in the £20-25 price range. It has a customer rating of 3 out of 5."}
{"source": "name : The Mill | eatType : coffee shop | food : French | priceRange : high | area : riverside | near : The Sorrento [SEP] The Mill is a French dining and coffee establishment found in riverside by The Sorrento, but bring your wallet as this is a bit high end.", "target": "The Mill is a coffee shop that serves French food in the high price range. It is located near The Sorrento in the riverside area."}
{"source": "name : The Eagle | food : Japanese | customer rating : 5 out of 5 [SEP] For a Japanese menu, try The Eagle. It scores high with a customer rating of 5 out of 5.", "target": "The Eagle is a Japanese restaurant with a 5 out of 5 customer rating."}
{"source": "name : The Eagle | food : Indian | customer rating : average [SEP] The Eagle is a restaurant that serves Indian food with average service", "target": "The Eagle is an Indian restaurant with average customer rating."}
